print('\n\МОДУЛЬ 1. Тема: Програмування лінійних алгоритмів та  розгалужених процесів')
print('Терещенко М.В., студент групи КМ-32')

while True:
    print("\nОбчислення в математичних задачах (Завдання 1)")
    print("Обчислення конкретної функції, в залежності від введеного значення х (Завдання 2)")
    print("Закінчити роботу з програмою (0)")
    task = input("Оберіть завдання зі списку, ввівши з клавіатури номер завдання: ")

    if task == '1':
        print('''\nСкласти програму для обчислення шляху, пройденого човном, якщо його швидкість в стоячій воді v км/год,
швидкість течії річки v1 км/год, час руху по озеру t1 год, а проти течії річки - t2 год.
Всі дані уводяться з клавіатури.\n''')

        while True:
            try:
                v = float(input("Введіть швидкість човна в стоячій воді: "))
                if v >= 0:
                    break
                else:
                    print('Введіть невід\'ємне число')
            except ValueError:
                print('Введіть дійсне число')

        while True:
            try:
                v1 = float(input("Введіть швидкість течії: "))
                if v1 >= 0:
                    break
                else:
                    print('Введіть невід\'ємне число')
            except ValueError:
                print('Введіть дійсне число')

        while True:
            try:
                t1 = float(input("Введіть час руху човна по озеру: "))
                if t1 >= 0:
                    break
                else:
                    print('Введіть невід\'ємне число')
            except ValueError:
                print('Введіть дійсне число')

        while True:
            try:
                t2 = float(input("Введіть час руху човна проти течії річки: "))
                if t2 >= 0:
                    break
                else:
                    print('Введіть невід\'ємне число')
            except ValueError:
                print('Введіть дійсне число')

        S = v * t1 + (v - v1) * t2  # формула для знаходження відстані
        print("\nЧовен пройшов відстань у %.1f кілометрів.\n" % S)

    elif task == '2':
        print('\nДан коло радіуса R. Визначити, чи поміститься правильний трикутник зі стороною а в цьому колі.')

        while True:
            try:
                R = float(input("Введіть радіус кола: "))
                if R >= 0:
                    break
                else:
                    print('Введіть невід\'ємне число')
            except ValueError:
                print('Введіть дійсне число')

        while True:
            try:
                a = float(input("Введіть довжину сторони правильного трикутника: "))
                if a >= 0:
                    break
                else:
                    print('Введіть невід\'ємне число')
            except ValueError:
                print('Введіть дійсне число')

        if R >= a / 3**0.5:
            print("\nДаний правильний трикутник поміститься у колі\n")
        else:
            print("\nДаний правильний трикутник не поміститься у колі\n")

    elif task == '0':
        break
    else:
        print("\nВи ввели неправильний номер завдання")
