"""
Зробимо функцію, яка буде перевіряти чи input є дійсним числом 
за допомогою конструкції try except
"""


def get_float(text):
    while True:
        try:
            num = float(input(text))
        except ValueError:
            print('Введіть дійсне число')
            continue
        else:
            break
    return num


"""
Зробимо функцію, яка буде перевіряти чи input є дійсним невід'ємним числом 
з використанням минулої функції
"""


def get_non_negative_float(text):
    while True:
        num = get_float(text)
        if num >= 0:
            return num
        else:
            print('Введіть невід\'ємне число')
            continue


"""
Наступна функція служить для виконання першого завдання
"""


def task1():
    print('''\nСкласти програму для обчислення шляху, пройденого човном, якщо його швидкість в стоячій воді v км / год, 
швидкість течії річки v1 км / ч, час руху по озеру t1 ч, а проти течії річки - t2 ч. 
Всі дані уводяться з клавіатури.\n''')
    v = get_non_negative_float("Введіть швидкість човна в стоячій воді: ")
    v1 = get_non_negative_float("Введіть швидкість течії: ")
    t1 = get_non_negative_float("Введіть час руху човна по озеру: ")
    t2 = get_non_negative_float("Введіть час руху човна проти течії річки: ")
    S = v * t1 + (v - v1) * t2  #формула для знаходження відстані
    return "Човен пройшов відстань у %.1f кілометрів." % S


"""
Ця функція служить для виконання другого завдання
"""


def task2():
    print('\nДан коло радіуса R (ввести з клавіатури). Визначити, чи поміститься правильний трикутник зі стороною а в цьому колі.')
    R = get_non_negative_float("Введіть радіус кола: ")
    a = get_non_negative_float(
        "Введіть довжину сторони правильного трикутника: ")
    """
    Максимальний рівносторнній трикутник вміщується в коло, це той для якого це коло є описаним,
    тому R повинно бути не менше за а поділити на корінь з 3
    """
    if R >= a / 3**0.5:
        return "Даний правильний трикутник поміститься у колі"
    else:
        return "Даний правильний трикутник не поміститься у колі"


"""
Зробимо меню для вибору завдання
"""


def choose_task():
    print("\nОбчислення в математичних задачах (Завдання 1)")
    print(
        "Обчислення конкретної функції, в залежності від введеного значення х(Завдання 2)")

    print("Закінчити роботу з програмою(0)")
    task = input(
        "Оберіть завдання зі списку ввівши з клавіатури номер завдання: ")
    if task == '1':
        print('\n' + task1() + '\n')
    elif task == '2':
        print('\n' + task2() + '\n')
    elif task == '0':
        return False
    else:
        print("\nВи ввели неправильний номер завдання")



print('\nМОДУЛЬ 1. Тема: Програмування лінійних алгоритмів та  розгалужених процесів')
print('Терещенко М.В., студент групи КМ-32')
"""
Цикл, який буде ідти до моменту, поки користувач не обере варіант: "Закінчити роботу з програмою"
"""
while True:
    if choose_task() == False:
        break