while True:
    print("\nОбчислення в математичних задачах (Завдання 1)")
    print(
        "Обчислення конкретної функції, в залежності від введеного значення х(Завдання 2)")

    print("Закінчити роботу з програмою(0)")
    task = input(
        "Оберіть завдання зі списку ввівши з клавіатури номер завдання: ")
    if task == '1':
        print('\n' + 'Task1' + '\n')
    elif task == '2':
        print('\n' + 'Task2' + '\n')
    elif task == '0':
        break
    else:
        print("\nВи ввели неправильний номер завдання")
