def get_float(text):
    while True:
        try:
            num = float(input(text))
        except ValueError:
            print('Введіть дійсне число')
            continue
        else:
            break
    return num

def task2():
    print('\nДан коло радіуса R (ввести з клавіатури). Визначити, чи поміститься правильний трикутник зі стороною а в цьому колі.')
    R = get_float("Введіть радіус кола: ")
    a = get_float("Введіть довжину сторони правильного трикутника: ")
    """
    Максимальний рівносторнній трикутник вміщується в коло, це той для якого це коло є описаним,
    тому R повинно бути не менше за а поділити на корінь з 3
    """
    if R >= a / 3**0.5:
        return "Даний правильний трикутник поміститься у колі"
    else:
        return "Даний правильний трикутник не поміститься у колі"
    
print(task2())