def get_float(text):
    while True:
        try:
            num = float(input(text))
        except ValueError:
            print('Введіть дійсне число')
            continue
        else:
            break
    return num

def task1():
    print('''\nСкласти програму для обчислення шляху, пройденого човном, якщо його швидкість в стоячій воді v км / год, 
швидкість течії річки v1 км / ч, час руху по озеру t1 ч, а проти течії річки - t2 ч. 
Всі дані уводяться з клавіатури.\n''')
    v = get_float("Введіть швидкість човна в стоячій воді: ")
    v1 = get_float("Введіть швидкість течії: ")
    t1 = get_float("Введіть час руху човна по озеру: ")
    t2 = get_float("Введіть час руху човна проти течії річки: ")
    S = v * t1 + (v - v1) * t2  #формула для знаходження відстані
    return "Човен пройшов відстань у %.1f кілометрів." % S
print(task1())